src/main/resources/ch_02/synapse-configs/default/api/StockQuoteInfoProvider.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  ~ Copyright (c) 2016, Kasun Indrasiri. (http://kasunpanorama.blogspot.com/) All Rights Reserved.
  ~
  ~ Licensed under the Apache License, Version 2.0 (the "License");
  ~ you may not use this file except in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~ http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing, software
  ~ distributed under the License is distributed on an "AS IS" BASIS,
  ~ WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~ See the License for the specific language governing permissions and
  ~ limitations under the License.
  -->

<api xmlns="http://ws.apache.org/ns/synapse"
     name="StockQuoteInfoProvider"
     context="/StockQuoteInfo">
    <resource methods="POST">
        <inSequence>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                                      xmlns:ser="http://services.samples">
                        <soapenv:Header/>
                        <soapenv:Body>
                            <ser:getSimpleQuote>
                                <ser:symbol>$1</ser:symbol>
                            </ser:getSimpleQuote>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="json" expression="$.getFinancialQuote.company"/>
                </args>
            </payloadFactory>
            <header name="Action" value="urn:getQuote"/>
            <call>
                <endpoint>
                    <address uri="http://localhost:6060/services/StockQuoteService"
                             format="soap11"/>
                </endpoint>
            </call>
            <property name="messageType"
                      value="application/json"
                      scope="axis2"
                      type="STRING"/>
            <respond/>
        </inSequence>
    </resource>
</api>
